C==========================================
      SUBROUTINE HCP_slip_twin(SLPDIR,SLPNOR,ROTATE)
      USE PARABANK
      IMPLICIT NONE
      integer::I,J,N
      DOUBLEPRECISION SLPDIR(1:3,1:42),SLPNOR(1:3,1:42)!滑移方向和滑移面法向
      DOUBLEPRECISION HSLD(1:4,1:42),HSLN(1:4,1:42)!六方晶系滑移方向和滑移面法向
      DOUBLEPRECISION ROTATE(1:3,1:3) ! 晶体坐标与全局坐标的旋转矩阵
      DOUBLEPRECISION TEM !临时变量
      DOUBLEPRECISION::RATIO=1.587 !六方晶系的轴径比
      DOUBLEPRECISION TEMP(1:3)
      double precision SIGMA0_SET(1:5),BURGER_SET(1:5) !滑移组的临界应力和burgers矢量
 
      DATA((HSLD(I,J),I=1,4),J=1,42)
     &/ -2.0,  1.0,  1.0,  0.0,
     &   1.0, -2.0,  1.0,  0.0,
     &   1.0,  1.0, -2.0,  0.0,   !Basal
     & 
     &  -2.0,  1.0,  1.0,  0.0,
     &   1.0, -2.0,  1.0,  0.0,
     &   1.0,  1.0, -2.0,  0.0,   !Prism
     &
     &  -2.0,  1.0,  1.0,  0.0,
     &   1.0, -2.0,  1.0,  0.0,
     &   1.0,  1.0, -2.0,  0.0,
     &  -2.0,  1.0,  1.0,  0.0,
     &   1.0, -2.0,  1.0,  0.0,
     &   1.0,  1.0, -2.0,  0.0,   !Pyram
     &
     &  -2.0,  1.0,  1.0,  3.0,
     &  -2.0,  1.0,  1.0,  3.0,
     &   1.0, -2.0,  1.0,  3.0,
     &   1.0, -2.0,  1.0,  3.0,
     &   1.0,  1.0, -2.0,  3.0,
     &   1.0,  1.0, -2.0,  3.0,
     &   2.0, -1.0, -1.0,  3.0,
     &   2.0, -1.0, -1.0,  3.0,
     &  -1.0,  2.0, -1.0,  3.0,
     &  -1.0,  2.0, -1.0,  3.0,
     &  -1.0, -1.0,  2.0,  3.0,
     &  -1.0, -1.0,  2.0,  3.0,   !PyramI
     &
     &  -2.0,  1.0,  1.0,  3.0,
     &   1.0, -2.0,  1.0,  3.0,
     &   1.0,  1.0, -2.0,  3.0,
     &   2.0, -1.0, -1.0,  3.0,
     &  -1.0,  2.0, -1.0,  3.0,
     &  -1.0, -1.0,  2.0,  3.0,   !PyramII
     &
     &  -1.0,  0.0,  1.0,  1.0,      
     &   0.0, -1.0,  1.0,  1.0,
     &   1.0, -1.0,  0.0,  1.0,
     &   1.0,  0.0, -1.0,  1.0,
     &   0.0,  1.0, -1.0,  1.0,
     &  -1.0,  1.0,  0.0,  1.0,   !{10-12}〈10-11〉 TT
 
     &   1.0,  1.0, -2.0, -3.0,
     &   1.0, -2.0,  1.0, -3.0,
     &  -2.0,  1.0,  1.0, -3.0,
     &  -1.0, -1.0,  2.0, -3.0,
     &  -1.0,  2.0, -1.0, -3.0,
     &   2.0, -1.0, -1.0, -3.0 /  !{11-22}〈11-2-3〉 CT
      
      DATA((HSLN(I,J),I=1,4),J=1,42)
     &/  0.0,  0.0,  0.0,  1.0,
     &   0.0,  0.0,  0.0,  1.0,
     &   0.0,  0.0,  0.0,  1.0,   !Basal
     &
     &   0.0,  1.0, -1.0,  0.0,
     &   1.0,  0.0, -1.0,  0.0,
     &  -1.0,  1.0,  0.0,  0.0,   !Prism
     &
     &   0.0,  1.0, -1.0,  1.0,
     &   1.0,  0.0, -1.0,  1.0,
     &  -1.0,  1.0,  0.0,  1.0,
     &   0.0, -1.0,  1.0,  1.0,
     &  -1.0,  0.0,  1.0,  1.0,
     &   1.0, -1.0,  0.0,  1.0,   !Pyram
     &
     &   1.0, -1.0,  0.0,  1.0,
     &   1.0,  0.0, -1.0,  1.0,
     &   0.0,  1.0, -1.0,  1.0,
     &  -1.0,  1.0,  0.0,  1.0,
     &  -1.0,  0.0,  1.0,  1.0,
     &   0.0, -1.0,  1.0,  1.0,
     &  -1.0,  1.0,  0.0,  1.0,
     &  -1.0,  0.0,  1.0,  1.0,
     &   1.0, -1.0,  0.0,  1.0,
     &   0.0, -1.0,  1.0,  1.0,
     &   1.0,  0.0, -1.0,  1.0,
     &   0.0,  1.0, -1.0,  1.0,   !PyramI
     &
     &   2.0, -1.0, -1.0,  2.0,
     &  -1.0,  2.0, -1.0,  2.0,
     &  -1.0, -1.0,  2.0,  2.0,
     &  -2.0,  1.0,  1.0,  2.0,
     &   1.0, -2.0,  1.0,  2.0,
     &   1.0,  1.0, -2.0,  2.0,   !PyramII
     &    
     &   1.0,  0.0, -1.0,  2.0,      
     &   0.0,  1.0, -1.0,  2.0,
     &  -1.0,  1.0,  0.0,  2.0,
     &  -1.0,  0.0,  1.0,  2.0,
     &   0.0, -1.0,  1.0,  2.0,
     &   1.0, -1.0,  0.0,  2.0,   !{10-12}〈10-11〉 TT

     &   1.0,  1.0, -2.0,  2.0,
     &   1.0, -2.0,  1.0,  2.0,
     &  -2.0,  1.0,  1.0,  2.0,
     &  -1.0, -1.0,  2.0,  2.0,
     &  -1.0,  2.0, -1.0,  2.0,
     &   2.0, -1.0, -1.0,  2.0 /  !{11-22}〈11-2-3〉 CT
      
      NSLIP  =  (/3,3,6,12,6/) !Basal, Prism, Pyram, PyramI, PyramII
      NTWIN  =  (/6,6/)   !TT, CT
      NSLPTL =  30
      NTWTL  =  12
      NSET   =  5
      TWSET  =  2 

      SIGMA0_SET= (/70.d0, 25.d0, 80.d0, 60.d0, 60.d0/)
      BURGER_SET= (/0.295D-6, 0.295D-6, 0.295D-6, 0.553D-6, 0.553D-6/)

C     设置滑移系的临界应力和burgers矢量
      N = 1
      DO I=1,NSET
          DO J=1,NSLIP(I)
              SIGMA0(N) = SIGMA0_SET(I)
              BURGER(N) = BURGER_SET(I)
              N = N+1
          END DO
      END DO
C     设置孪晶系的临界应力和burgers矢量为0
      DO I=NSLPTL+1,NSLPTL+NTWTL
          SIGMA0(I) = 0.0D0
          BURGER(I) = 0.0D0
      END DO
      
C     六方晶系转换为直角坐标系
      TEM=3.
      DO J=1,42
          SLPDIR(1,J)=(HSLD(1,J)-HSLD(3,J))*SQRT(TEM)/2.
          SLPDIR(2,J)=HSLD(2,J)-(HSLD(1,J)+HSLD(3,J))/2.
          SLPDIR(3,J)=HSLD(4,J)*RATIO
          
          SLPNOR(1,J)=(2.*HSLN(1,J)+HSLN(2,J))/SQRT(TEM)
          SLPNOR(2,J)=HSLN(2,J)
          SLPNOR(3,J)=HSLN(4,J)/RATIO
      END DO

c-----把滑移方向和滑移面法向单位化
      DO J=1,42
          CALL UNITIZE(SLPDIR(1:3,J))
          CALL UNITIZE(SLPNOR(1:3,J))
      END DO

c-----把滑移方向和滑移面法向转换到全局坐标系
      DO J=1,42
      CALL MULTIP(ROTATE,3,3,SLPDIR(1,J),1,TEMP)
      DO I=1,3
          SLPDIR(I,J)=TEMP(I)
      END DO

      CALL MULTIP(ROTATE,3,3,SLPNOR(1,J),1,TEMP)
      DO I=1,3
          SLPNOR(I,J)=TEMP(I)
      END DO
      END DO

      RETURN
      END SUBROUTINE HCP_slip_twin

C==========================================
c-----把矢量单位化的子程序
      SUBROUTINE UNITIZE(A)
      integer::I
      DOUBLEPRECISION NORM ! 函数声明
      DOUBLEPRECISION A(1:3),TEM
      TEM=NORM(A)
      DO I=1,3
            A(I)=A(I)/TEM
      END DO
      END
            
      DOUBLEPRECISION FUNCTION NORM(A)
      integer::I
      DOUBLEPRECISION A(1:3)
      NORM=0
      DO I=1,3
            NORM=NORM+A(I)**2
      END DO
      NORM=SQRT(NORM)
      END   

